espressif/esp-idf/components/soc/esp32s3/include/soc/rtc_cntl_struct.h
            uint32_t touch_clk_fo                  :    1;  /*touch clock force on*/
            uint32_t touch_clkgate_en              :    1;  /*touch clock enable*/
        };
        uint32_t val;
    } touch_ctrl2;
    union {
        struct {
            uint32_t touch_denoise_res             :    2;  /*De-noise resolution: 12/10/8/4 bit*/
            uint32_t touch_denoise_en              :    1;  /*touch pad0 will be used to de-noise*/
            uint32_t reserved3                     :    5;
            uint32_t touch_inactive_connection     :    1;  /*inactive touch pads connect to 1: gnd 0: HighZ*/
            uint32_t touch_shield_pad_en           :    1;  /*touch pad14 will be used as shield*/
            uint32_t touch_scan_pad_map            :    15;  /*touch scan mode pad enable map*/
            uint32_t touch_bufdrv                  :    3;  /*touch7 buffer driver strength*/
            uint32_t touch_out_ring                :    4;  /*select out ring pad*/
        };
        uint32_t val;
    } touch_scan_ctrl;
    union {
        struct {
            uint32_t touch_slp_th                  :    22;  /*the threshold for sleep touch pad*/
            uint32_t reserved22                    :    4;
            uint32_t touch_slp_approach_en         :    1;  /*sleep pad approach function enable*/
            uint32_t touch_slp_pad                 :    5;  /* */
        };
        uint32_t val;
    } touch_slp_thres;
    union {
        struct {
            uint32_t reserved0                     :    23;
            uint32_t touch_slp_channel_clr         :    1;  /*clear touch slp channel*/
            uint32_t touch_approach_meas_time      :    8;  /*approach pads total meas times*/
        };
        uint32_t val;
    } touch_approach;
    union {
        struct {
            uint32_t reserved0                     :    7;
            uint32_t touch_bypass_neg_noise_thres  :    1;
            uint32_t touch_bypass_noise_thres      :    1;
            uint32_t touch_smooth_lvl              :    2;
            uint32_t touch_jitter_step             :    4;  /*touch jitter step*/
            uint32_t touch_neg_noise_limit         :    4;  /*negative threshold counter limit*/
            uint32_t touch_neg_noise_thres         :    2;
            uint32_t touch_noise_thres             :    2;
            uint32_t touch_hysteresis              :    2;
            uint32_t touch_debounce                :    3;  /*debounce counter*/
            uint32_t touch_filter_mode             :    3;  /*0: IIR ? 1: IIR ? 2: IIR 1/8 3: Jitter*/
            uint32_t touch_filter_en               :    1;  /*touch filter enable*/
        };
        uint32_t val;
    } touch_filter_ctrl;
    union {
        struct {
            uint32_t usb_vrefh                     :    2;
            uint32_t usb_vrefl                     :    2;
            uint32_t usb_vref_override             :    1;
            uint32_t usb_pad_pull_override         :    1;
            uint32_t usb_dp_pullup                 :    1;
            uint32_t usb_dp_pulldown               :    1;
            uint32_t usb_dm_pullup                 :    1;
            uint32_t usb_dm_pulldown               :    1;
            uint32_t usb_pullup_value              :    1;
            uint32_t usb_pad_enable_override       :    1;
            uint32_t usb_pad_enable                :    1;
            uint32_t usb_txm                       :    1;
            uint32_t usb_txp                       :    1;
            uint32_t usb_tx_en                     :    1;
            uint32_t usb_tx_en_override            :    1;
            uint32_t usb_reset_disable             :    1;
            uint32_t io_mux_reset_disable          :    1;
            uint32_t reserved19                    :    13;
        };
        uint32_t val;
    } usb_conf;
    union {
        struct {
            uint32_t touch_timeout_num             :    22;
            uint32_t touch_timeout_en              :    1;
            uint32_t reserved23                    :    9;
        };
        uint32_t val;
    } touch_timeout_ctrl;
    union {
        struct {
            uint32_t reject_cause                  :    18;  /*sleep reject cause*/
            uint32_t reserved18                    :    14;
        };
        uint32_t val;
    } slp_reject_cause;
    union {
        struct {
            uint32_t force_download_boot           :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } option1;
    union {
        struct {
            uint32_t wakeup_cause                  :    17;  /*sleep wakeup cause*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } slp_wakeup_cause;
    union {
        struct {
            uint32_t reserved0                     :    8;
            uint32_t ulp_cp_timer_slp_cycle        :    24;  /*sleep cycles for ULP-coprocessor timer*/
        };
        uint32_t val;
    } ulp_cp_timer_1;
    union {
        struct {
            uint32_t slp_wakeup_w1ts               :    1;  /*enable sleep wakeup interrupt*/
            uint32_t slp_reject_w1ts               :    1;  /*enable sleep reject interrupt*/
            uint32_t sdio_idle_w1ts                :    1;  /*enable SDIO idle interrupt*/
            uint32_t rtc_wdt_w1ts                  :    1;  /*enable RTC WDT interrupt*/
            uint32_t rtc_touch_scan_done_w1ts      :    1;  /*enable touch scan done interrupt*/
            uint32_t rtc_ulp_cp_w1ts               :    1;  /*enable ULP-coprocessor interrupt*/
            uint32_t rtc_touch_done_w1ts           :    1;  /*enable touch done interrupt*/
            uint32_t rtc_touch_active_w1ts         :    1;  /*enable touch active interrupt*/
            uint32_t rtc_touch_inactive_w1ts       :    1;  /*enable touch inactive interrupt*/
            uint32_t w1ts                          :    1;  /*enable brown out interrupt*/
            uint32_t rtc_main_timer_w1ts           :    1;  /*enable RTC main timer interrupt*/
            uint32_t rtc_saradc1_w1ts              :    1;  /*enable saradc1 interrupt*/
            uint32_t rtc_tsens_w1ts                :    1;  /*enable tsens interrupt*/
            uint32_t rtc_cocpu_w1ts                :    1;  /*enable riscV cocpu interrupt*/
            uint32_t rtc_saradc2_w1ts              :    1;  /*enable saradc2 interrupt*/
            uint32_t rtc_swd_w1ts                  :    1;  /*enable super watch dog interrupt*/
            uint32_t rtc_xtal32k_dead_w1ts         :    1;  /*enable xtal32k_dead  interrupt*/
            uint32_t rtc_cocpu_trap_w1ts           :    1;  /*enable cocpu trap interrupt*/
            uint32_t rtc_touch_timeout_w1ts        :    1;  /*enable touch timeout interrupt*/
            uint32_t rtc_glitch_det_w1ts           :    1;  /*enbale gitch det interrupt*/
            uint32_t rtc_touch_approach_loop_done_w1ts:    1;
            uint32_t reserved21                    :    11;
        };
        uint32_t val;
    } int_ena_w1ts;
    union {
        struct {
            uint32_t slp_wakeup_w1tc               :    1;  /*enable sleep wakeup interrupt*/
            uint32_t slp_reject_w1tc               :    1;  /*enable sleep reject interrupt*/
            uint32_t sdio_idle_w1tc                :    1;  /*enable SDIO idle interrupt*/
            uint32_t rtc_wdt_w1tc                  :    1;  /*enable RTC WDT interrupt*/
            uint32_t rtc_touch_scan_done_w1tc      :    1;  /*enable touch scan done interrupt*/
            uint32_t rtc_ulp_cp_w1tc               :    1;  /*enable ULP-coprocessor interrupt*/
            uint32_t rtc_touch_done_w1tc           :    1;  /*enable touch done interrupt*/
            uint32_t rtc_touch_active_w1tc         :    1;  /*enable touch active interrupt*/
            uint32_t rtc_touch_inactive_w1tc       :    1;  /*enable touch inactive interrupt*/
            uint32_t w1tc                          :    1;  /*enable brown out interrupt*/
            uint32_t rtc_main_timer_w1tc           :    1;  /*enable RTC main timer interrupt*/
            uint32_t rtc_saradc1_w1tc              :    1;  /*enable saradc1 interrupt*/
            uint32_t rtc_tsens_w1tc                :    1;  /*enable tsens interrupt*/
            uint32_t rtc_cocpu_w1tc                :    1;  /*enable riscV cocpu interrupt*/
            uint32_t rtc_saradc2_w1tc              :    1;  /*enable saradc2 interrupt*/
            uint32_t rtc_swd_w1tc                  :    1;  /*enable super watch dog interrupt*/
            uint32_t rtc_xtal32k_dead_w1tc         :    1;  /*enable xtal32k_dead  interrupt*/
            uint32_t rtc_cocpu_trap_w1tc           :    1;  /*enable cocpu trap interrupt*/
            uint32_t rtc_touch_timeout_w1tc        :    1;  /*enable touch timeout interrupt*/
            uint32_t rtc_glitch_det_w1tc           :    1;  /*enbale gitch det interrupt*/
            uint32_t rtc_touch_approach_loop_done_w1tc:    1;
            uint32_t reserved21                    :    11;
        };
        uint32_t val;
    } int_ena_w1tc;
    union {
        struct {
            uint32_t reserved0                     :    26;
            uint32_t retention_en                  :    1;
            uint32_t retention_wait                :    5;  /*wait cycles for rention operation*/
        };
        uint32_t val;
    } retention_ctrl;
    union {
        struct {
            uint32_t rtc_fib_sel                   :    3;  /*select use analog fib signal*/
            uint32_t reserved3                     :    29;
        };
        uint32_t val;
    } fib_sel;
    union {
        struct {
            uint32_t date                          :    28;
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } date;
} rtc_cntl_dev_t;
extern rtc_cntl_dev_t RTCCNTL;
#ifdef __cplusplus
}
#endif



#endif /*_SOC_RTC_CNTL_STRUCT_H_ */
